Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh44-45-v3.tmx
Source language: bo
Languages: en

source: ཐལ་མོ་སྦྱར་ནས་འདི་སྐད་ཅེས་སྨྲས་སོ། །འཕགས་མ་ལྷ་མོ་བདག་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡང་དག་པར་ཞུགས་པ་སྟེ། བདག་ནི་དགེ་བའི་བཤེས་གཉེན་གྱི་རྟེན་གྱིས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་སློབ་ཅིང་།
en: With his hands placed together in homage, he said, “Āryā, I have entered upon the highest, complete enlightenment, and through relying on kalyāṇamitras I am training in bodhisattva conduct.

source: བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་ཞུགས་ཏེ། བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་ནན་ཏན་དུ་བགྱི་བ་དང་།
en: I have entered into bodhisattva conduct, and I am practicing bodhisattva conduct.

source: བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་རབ་ཏུ་གནས་པས་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་འབྱུང་བར་འཚལ་ན།
en: I wish to bring forth omniscience through being established in bodhisattva conduct.

source: འཕགས་མ་ལྷ་མོ་ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་བསླབ་པར་བགྱི་བ་དང་། ཇི་ལྟར་ནན་ཏན་དུ་བགྱི་བ་བདག་ལ་བཤད་དུ་གསོལ།
en: Therefore, Āryā, goddess, I pray that you explain to me how bodhisattvas should train in bodhisattva conduct and how they should practice it!”

source: དེ་ནས་མཚན་མོའི་ལྷ་མོ་སྒྲ་རྒྱ་མཚོ་རབ་ཏུ་ཞི་བ་དང་ལྡན་པས། ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །རིགས་ཀྱི་བུ་དེ་ལྟར་ཁྱོད་དགེ་བའི་བཤེས་གཉེན་གྱི་རྟེན་གྱིས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ཡོངས་སུ་ཚོལ་བ་ལེགས་སོ་ལེགས་སོ། །
en: The night goddess Praśanta­ruta­sāgara­vatī said to Sudhana, the head merchant’s son, “Noble one, it is excellent, excellent, that in this way you seek bodhisattva conduct by relying on kalyāṇamitras.

source: རིགས་ཀྱི་བུ་ཁོ་མོ་ནི་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་བ་དགའ་བ་ཡངས་པའི་ཤུགས་འབྱུང་བས་སེམས་ཀྱི་སྐད་ཅིག་རྣམ་པར་བརྒྱན་པ་ཐོབ་པའོ། །
en: Noble one, I have attained the bodhisattva liberation called the display in each instant of mind of the arising of the power of vast delight.”

source: ནོར་བཟངས་ཀྱིས་སྨྲས་པ། འཕགས་མ་ཁྱོད་ནི་འཕྲིན་ལས་ཅི་མཛད་ཡུལ་གང་དང་ལྡན་སྦྱོར་བ་གང་དང་ལྡན།
en: Sudhana asked, “Āryā, what kind of activity do you accomplish?

source: ཅི་ལ་རྣམ་པར་དཔྱོད།
en: What kind of range do you have?

source: བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་དགའ་བ་ཡངས་པའི་ཤུགས་འབྱུང་བས་སེམས་ཀྱི་སྐད་ཅིག་རྣམ་པར་བརྒྱན་བ་དེའི་ཡུལ་ནི་ཇི་ལྟ་བུ་ཞིག་མཆིས་དེས་སྨྲས་པ།
en: What is your practice? What do you contemplate? What is the range of the bodhisattva liberation called the display in each instant of mind of the arising of the power of vast delight?”

source: རིགས་ཀྱི་བུ་ཁོ་མོ་ནི་སེམས་དང་བསམ་པ་རྒྱ་མཚོ་ཡོངས་སུ་དག་པའི་མཉམ་པ་ཉིད་ལ་ཞུགས་པ་སྟེ།
en: She replied, “Noble one, I have entered the equanimity of the purification of the ocean of mind and thought.

source: འཇིག་རྟེན་གྱི་རྡུལ་དང་དྲི་མ་ཐམས་ཅད་རྣམ་པར་བསལ་བས་མི་ཕྱེད་པས་བརྒྱན་པའི་བསམ་པ་ལ་ཞུགས་པའོ། །
en: I have attained the aspiration for an inviolable display that is clear of all worldly dust and dirt.

source: བརྩམས་པ་ལས་མི་ལྡོག་མི་བཟློག་པའི་སེམས་དང་ལྡན་པའོ། །
en: I have a mind that will not regress or turn back from this undertaking.

source: རིན་པོ་ཆེའི་རི་བོ་ལྟར་ཡོན་ཏན་གྱིས་བརྒྱན་པའི་སེམས་མི་སྒུལ་བ་དང་ལྡན་པའོ། །
en: I have a mind that is like an unshakable jewel mountain adorned by qualities.

source: མི་གནས་མི་རྟེན་པའི་སེམས་དང་ལྡན་པའོ། །
en: I have a mind that is not stationed anywhere, not located anywhere.

source: འགྲོ་བ་ཐམས་ཅད་ཡོངས་སུ་བསྐྱབ་པ་ལ་མངོན་པར་ཕྱོགས་པའི་སེམས་དང་ལྡན་པའོ། །
en: I have a mind that is focused on saving all beings.

source: སངས་རྒྱས་རྒྱ་མཚོ་ཐམས་ཅད་མཐོང་བས་མི་ངོམས་པའི་སེམས་དང་ལྡན་པའོ། །
en: I have a mind that never tires of seeing the ocean of all the buddhas.

source: བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱི་སྟོབས་ཀྱིས་བསམ་པ་རྣམ་པར་དག་པའི་སེམས་དང་ལྡན་པའོ། །
en: I have a mind that has a pure motivation. I have a mind that has the strength of all the bodhisattvas.

source: དྲན་པའི་རྒྱ་མཚོ་ཡེ་ཤེས་ཀྱི་སྣང་བ་ཆེན་པོས་བརྒྱན་པ་ལ་ཡང་དག་པར་གནས་པའི་སེམས་དང་ལྡན་པའོ། །
en: I have a mind that dwells in an ocean of the awareness of the display of the light of great wisdom.

source: སེམས་ཅན་ཐམས་ཅད་མྱ་ངན་གྱི་དགོན་པ་ལས་ཡང་དག་པར་བཟླ་བ་ལ་ཞུགས་པའོ། །
en: I am engaged in leading all beings out of the wilderness of misery.

source: སེམས་ཅན་ཐམས་ཅད་སྡུག་བསྔལ་བ་དང་ཡིད་མི་བདེ་བ་ལས་རྣམ་པར་བཟློག་པ་ལ་མངོན་པར་བརྩོན་པའོ། །
en: I am dedicated to dispelling the sufferings and unhappiness of all beings.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཡིད་དུ་མི་འོང་བའི་གཟུགས་དང་། །སྒྲ་དང་དྲི་དང་རེག་ཡོངས་སུ་རྒྱུ་བ་རྣམ་པར་བཟློག་པ་ལ་ཞུགས་པའོ། །སེམས་ཅན་ཐམས་ཅད་ཀྱི་སྡུག་པ་དང་།
en: I am engaged in turning beings away from involvement with unpleasant form, sound, smell, taste, and touch.

source: མི་སྡུག་པ་དང་བྲལ་ཞིང་ཕྲད་པའི་སྡུག་བསྔལ་རབ་ཏུ་ཞི་བར་བ་བ་ལ་ཞུགས་པའོ། །
en: I am engaged in ending the suffering of being separated from what is liked and encountering what is disliked.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཡུལ་གྱི་རྐྱེན་ལས་བྱུང་བས་མགོ་རྨོངས་བའི་སྡུག་བསྔལ་རྣམ་པར་བཟློག་པ་ལ་རབ་ཏུ་བརྩོན་པའོ། །
en: I am dedicated to dispelling the suffering of ignorance that arises in relation to the scope of perception.

source: ལོག་པར་ལྷུང་བའི་སེམས་ཅན་ཐམས་ཅད་ཀྱི་རྟེན་དུ་གྱུར་བའོ། །
en: I am a support for all beings who fall.

source: སེམས་ཅན་ཐམས་ཅད་འཁོར་བའི་གནས་ཀྱི་སྡུག་བསྔལ་ལས་འབྱུང་བ་ཡང་དག་པར་སྟོན་པ་ལ་མངོན་པར་བརྩོན་པའོ། །
en: I am dedicated to revealing to all beings the way out of the suffering of being in saṃsāra.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་རྒ་ཤི་དང་མྱ་ངན་དང་སྨྲེ་སྔགས་འདོན་པ་དང་། སྡུག་བསྔལ་བ་དང་ཡིད་མི་བདེ་བ་དང་། འཁྲུག་པ་རྣམ་པར་བཟློག་པ་ལ་ཞུགས་པའོ། །
en: I am engaged in eliminating the aging, death, misery, lamentation, suffering, unhappiness, and tribulations of all beings.

source: སེམས་ཅན་ཐམས་ཅད་ལ་དེ་བཞིན་གཤེགས་པའི་བདེ་བ་བླ་ན་མེད་པ་ཡོངས་སུ་བསྒྲུབ་པར་ཞུགས་པ་སྟེ། གྲོང་དང་།
en: I am engaged in causing all beings to attain the supreme happiness of the tathāgatas.

source: གྲོང་ཁྱེར་དང་། ལྗོངས་དང་། ཡུལ་དང་། ཁམས་དང་། རྒྱལ་པོའི་གནས་ན་འཁོད་པའི་སེམས་ཅན་ཐམས་ཅད་བདེ་བར་རིམ་གྲོར་བྱ་བས་ཉམས་དགའ་བར་འགྱུར་ཞིང་དེ་དག་ལ་ཆོས་དང་མཐུན་པར་བསྲུང་བ་དང་།
en: I gain satisfaction through bringing to happiness all beings in villages, towns, countrysides, kingdoms, realms, and capital cities, and in ways that accord with the Dharma I guard them, protect them, and help them.

source: བསྐྱབ་པ་དང་། རིམ་གྲོར་བྱ་བ་ཡང་ལེགས་པར་བྱེད་དེ། དེ་དག་རིམ་པས་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ཡོངས་སུ་སྨྱིན་པར་བྱེད་དོ། །འདི་ལྟ་སྟེ་ཁང་ཁྱིམ་དང་། གཞལ་མེད་ཁང་ན་གནས་པའི་སེམས་ཅན་རྣམས་ཀྱི་མངོན་པར་ཆགས་པ་མེད་པ་ཡོངས་སུ་བསྐྱེད་དོ། །
en: “I gradually ripen them for omniscience in this way: I develop nonattachment within beings who dwell in mansions and aerial palaces.

source: ཡིད་མི་བདེ་བ་དེ་དང་དེ་དག་ཀྱང་རྣམ་པར་སེལ་ཏོ། །
en: I dispel their unhappiness.

source: མངོན་པར་ཞེན་པ་ཐམས་ཅད་རྒྱུན་གཅོད་པ་དང་།
en: I bring an end to all attachments.

source: ཆོས་ཐམས་ཅད་ཀྱི་རང་བཞིན་ཡོངས་སུ་ཤེས་པར་བྱ་བའི་ཕྱིར་ཆོས་སྟོན་ཏོ། །
en: I teach them the Dharma so that they will know the nature of all phenomena.

source: ཕ་མ་དང་ཕུ་ནུ་དང་སྲིང་མོ་དང་གཉེན་བཤེས་དང་འགྲོགས་པའི་སེམས་ཅན་ཡུན་རིང་པོ་ནས་བཤེས་ཤིང་མཛའ་བར་གྱུར་པ་དང་ལ་སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་དང་ཕྲད་པར་བྱ་བའི་ཕྱིར་ཆོས་སྟོན་ཏོ། །
en: I teach the Dharma to those who for a long time have been close and affectionate with fathers, mothers, brothers, sisters, relatives, and friends, so that they will meet buddhas and bodhisattvas.

source: བུ་སྨད་དང་འགྲོགས་པའི་སེམས་ཅན་རྣམས་ལ་འཁོར་བའི་སྲེད་པ་ཐམས་ཅད་རབ་ཏུ་སྤང་བ་དང་། སེམས་ཅན་ཐམས་ཅད་ལ་མཉམ་པ་ཉིད་ཀྱི་སེམས་སུ་བྱ་བ་དང་། སྙིང་རྗེ་ཆེན་པོ་རབ་ཏུ་ཐོབ་པར་བྱ་བའི་ཕྱིར་ཆོས་སྟོན་ཏོ། །
en: I teach the Dharma so that beings who spend time with their wives will forsake all craving for saṃsāra, view all beings equally, and attain great compassion.

source: ཚོང་དུས་ཀྱི་དབུས་ན་འཁོད་པའི་སེམས་ཅན་རྣམས་ལ་འཕགས་པའི་དགེ་འདུན་དང་། དེ་བཞིན་གཤེགས་པ་མཐོང་བར་བྱ་བ་ལ་ཡང་དག་པར་གཞོལ་བར་བྱ་བའི་ཕྱིར་ཆོས་སྟོན་ཏོ། །
en: I teach the Dharma so that those who are in the middle of markets will become engaged in seeing the noble saṅgha and the tathāgatas.

source: ལོངས་སྤྱོད་ཀྱི་དྲེགས་པས་མྱོས་པའི་སེམས་ཅན་རྣམས་ལ་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་བྱ་བའི་ཕྱིར་ཆོས་སྟོན་ཏོ། །
en: I teach the Dharma so that beings who are intoxicated by pride in their pleasure will complete the perfection of patience.

source: གླུ་དང་གར་དང་རོལ་མོ་ལ་མངོན་པར་དགའ་བའི་སེམས་ཅན་རྣམས་ལ་ཆོས་ཀྱི་དགའ་བ་ལ་མོས་པར་བྱ་བའི་ཕྱིར་ཆོས་སྟོན་ཏོ། །
en: I teach the Dharma so that those beings who delight in songs, dance, and music will aspire to delight in the Dharma.

source: ཡུལ་གྱི་དགའ་བ་ལ་ཆགས་པའི་སེམས་ཅན་རྣམས་ལ་དེ་བཞིན་གཤེགས་པའི་ཡུལ་ལ་ཡང་དག་པར་གཞོལ་བར་བྱ་བའི་ཕྱིར་ཆོས་སྟོན་ཏོ། །
en: I teach the Dharma so that beings who are attached to the delights of the perceptions of their senses will become engaged in the perception of the tathāgatas.

source: ཁྲོ་བས་ཡོངས་སུ་ནོན་པའི་སེམས་ཅན་རྣམས་ལ་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་རབ་ཏུ་དགོད་པར་བྱ་བའི་ཕྱིར་ཆོས་སྟོན་ཏོ། །
en: I teach the Dharma so that beings oppressed by anger will become established in the perfection of patience.

source: སེམས་ཅན་ལེ་ལོ་ཅན་རྣམས་ལ་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་དག་པར་བྱ་བའི་ཕྱིར་ཆོས་སྟོན་ཏོ། །
en: I teach the Dharma so that beings who are lazy will have the pure perfection of diligence.

source: སེམས་རྣམ་པར་མྱོས་པའི་སེམས་ཅན་རྣམས་ལ་དེ་བཞིན་གཤེགས་པའི་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་རབ་ཏུ་ཐོབ་པར་བྱ་བའི་ཕྱིར་ཆོས་སྟོན་ཏོ། །
en: I teach the Dharma so that beings who are deranged will attain the perfection of the meditation of the tathāgatas.

source: ལྟ་བུའི་རྣམ་པ་ཐིབས་པོར་སུབས་པའི་སེམས་ཅན་མ་རིག་པའི་མུན་ནག་ན་འཐོམས་པ་རྣམས་ལ་ལྟ་བའི་རྣམ་པ་ཐིབས་པོ་དང་མ་རིག་པའི་མུན་པ་རྣམ་པར་བསྩལ་བའི་ཕྱིར་ཆོས་སྟོན་ཏོ། །
en: I teach the Dharma so that beings who are in the thicket of wrong views and blinded by the darkness of ignorance will eliminate the thicket of wrong views and the darkness of ignorance.

source: ཤེས་རབ་འཆལ་བ་ཅན་གྱི་སེམས་ཅན་རྣམས་ལ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་རབ་ཏུ་ཐོབ་པར་བྱ་བའི་ཕྱིར་ཆོས་སྟོན་ཏོ། །
en: I teach the Dharma so that beings who are stupid will attain the perfection of wisdom.

source: ཁམས་གསུམ་པ་ལ་མངོན་པར་ཞེན་པའི་སེམས་ཅན་རྣམས་ལ་འཁོར་བ་ལས་འབྱུང་བར་བྱ་བའི་ཕྱིར་ཆོས་སྟོན་ཏོ། །
en: I teach the Dharma so that beings who are attached to the three realms will depart from saṃsāra.

source: དམའ་བ་ལ་མོས་པའི་སེམས་ཅན་རྣམས་ལ་དེ་བཞིན་གཤེགས་པའི་བྱང་ཆུབ་ཏུ་སྨོན་ལམ་ཡོངས་སུ་རྫོགས་པར་བྱ་བའི་ཕྱིར་ཆོས་སྟོན་ཏོ། །
en: I teach the Dharma so that beings who are attracted to what is inferior will have the complete aspiration for the enlightenment of the tathāgatas.

source: བདག་ལ་ཕན་པར་བརྩོན་པའི་སེམས་ཅན་རྣམས་ལ་སེམས་ཅན་ཐམས་ཅད་ལ་ཕན་པར་བྱ་བའི་སྨོན་ལམ་ཡོངས་སུ་རྫོགས་པར་འགྱུར་བར་བྱ་བའི་ཕྱིར་ཆོས་སྟོན་ཏོ། །
en: I teach the Dharma so that beings who are dedicated to benefiting themselves will have the complete aspiration to benefit all beings.

source: བསམ་པ་ཉམ་ཆུང་བའི་སེམས་ཅན་རྣམས་ལ་བྱང་ཆུབ་སེམས་དཔའི་སྟོབས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་རྣམ་པར་དག་པར་བ་བའི་ཕྱིར་ཆོས་སྟོན་ཏོ། །
en: I teach the Dharma so that beings who have weak motivation will have the pure perfection of the strength of the bodhisattvas.

source: མ་རིག་པའི་མུན་པས་སེམས་བློང་བའི་སེམས་ཅན་རྣམས་ལ་བྱང་ཆུབ་སེམས་དཔའི་ཡེ་ཤེས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་རྣམ་པར་དག་པར་བྱ་བའི་ཕྱིར་ཆོས་སྟོན་ཏོ། །
en: I teach the Dharma so that beings whose minds are dimmed by the darkness of ignorance will have the pure perfection of knowledge of the bodhisattvas.

source: གཟུགས་མི་སྡུག་པ་དང་ལྡན་པའི་སེམས་ཅན་རྣམས་ལ་དེ་བཞིན་གཤེགས་པའི་གཟུགས་ཀྱི་སྐུ་རྣམ་པར་དག་པར་བྱ་བའི་ཕྱིར་ཆོས་སྟོན་ཏོ། །
en: I teach the Dharma so that beings with ugly bodies will have the form body of a tathāgata.

source: ལུས་ཀྱི་དབྱིབས་མི་མཛེས་པ་དང་ལྡན་པའི་སེམས་ཅན་རྣམས་ལ་ཆོས་ཀྱི་སྐུ་བླ་ན་མེད་པ་རྣམ་པར་དག་པའི་ཕྱིར་ཆོས་སྟོན་ཏོ། །
en: I teach the Dharma so that beings with misshapen bodies will have the supreme Dharma body.

source: ཁ་དོག་མི་སྡུག་པ་དང་ལྡན་པའི་སེམས་ཅན་རྣམས་ལ་དེ་བཞིན་གཤེགས་པའི་སྐུ་མདོག་གསེར་གྱི་ཁ་དོག་ལྟ་བུ་དང་ཤིན་ཏུ་འཇམ་ཞིང་ཀ་ཙ་ལིནྡ་ཀ་ལྟར་རེག་ན་བདེ་བའི་ལུས་རྣམ་པར་དག་པའི་ཕྱིར་ཆོས་སྟོན་ཏོ། །
en: I teach the Dharma so that beings with an ugly color will have a body that is golden like the body of the tathāgatas and is as soft as down and pleasant to the touch.

source: སྡུག་བསྔལ་བའི་སེམས་ཅན་རྣམས་ལ་དེ་བཞིན་གཤེགས་པའི་བདེ་བ་དམ་པ་ཐོབ་པར་བྱ་བའི་ཕྱིར་ཆོས་སྟོན་ཏོ། །
en: I teach the Dharma so that beings who are suffering will attain the ultimate happiness of the tathāgatas.

source: བདེ་བའི་སེམས་ཅན་རྣམས་ལ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བདེ་བ་རབ་ཏུ་ཐོབ་པར་བྱ་བའི་ཕྱིར་ཆོས་སྟོན་ཏོ། །
en: I teach the Dharma so that beings who have happiness will attain the happiness of omniscience.

source: ནད་པ་ན་བའི་སེམས་ཅན་རྣམས་ལ་བྱང་ཆུབ་སེམས་དཔའི་ལུས་གཟུགས་བརྙན་ལྟ་བུ་ཡོངས་སུ་གྲུབ་པར་བྱ་བའི་ཕྱིར་ཆོས་སྟོན་ཏོ། །
en: I teach the Dharma so that beings who are ill will attain the body of a bodhisattva that is like a reflection.

source: དགའ་བ་སྣ་ཚོགས་ལ་བརྩོན་པའི་སེམས་ཅན་རྣམས་ལ་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པའི་དགའ་བ་རབ་ཏུ་ཐོབ་པར་བྱ་བའི་ཕྱིར་ཆོས་སྟོན་ཏོ། །
en: I teach the Dharma so that beings who are dedicated to various delights will attain delight in bodhisattva conduct.

source: ཕོངས་པའི་སེམས་ཅན་རྣམས་ལ་བྱང་ཆུབ་སེམས་དཔའི་ཆོས་ཀྱི་གཏེར་དང་མཛོད་རབ་ཏུ་ཐོབ་པར་བྱ་བའི་ཕྱིར་ཆོས་སྟོན་ཏོ། །
en: I teach the Dharma so that beings who are destitute will obtain the store of treasures of the bodhisattva Dharma.

source: བཟའ་ཤིང་གི་ར་བ་ན་གནས་པའི་སེམས་ཅན་རྣམས་ལ་སངས་རྒྱས་ཀྱི་ཆོས་ཡོངས་ས་བཙལ་བ་ལ་མངོན་པར་བརྩོན་པའི་རྒྱུ་ཐོབ་པར་བྱ་བའི་ཕྱིར་ཆོས་སྟོན་ཏོ། །
en: I teach the Dharma so that beings who go to parks will obtain the cause for dedication to seeking the Buddha’s Dharma.

source: ལམ་དུ་ཞུགས་པའི་སེམས་ཅན་རྣམས་ལ་ཐམས་ཅད་མཁྱེན་པའི་ལམ་དུ་འཇུག་པར་བྱ་བའི་ཕྱིར་ཆོས་སྟོན་ཏོ། །
en: I teach the Dharma so that beings who are on the road will follow the road to omniscience.

source: གྲོང་ན་གནས་པའི་སེམས་ཅན་རྣམས་ལ་ཁམས་གསུམ་པ་ཐམས་ཅད་ལས་འབྱུང་བར་བྱ་བའི་ཕྱིར་ཆོས་སྟོན་ཏོ། །
en: I teach the Dharma so that beings who are in villages will depart from the three realms altogether.

source: ཡུལ་གྱི་འདབ་ན་གནས་པའི་སེམས་ཅན་རྣམས་ལ་ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཀྱི་ལམ་ལས་ཡང་དག་པར་འདའ་བར་བྱ་བ་དང་། དེ་བཞིན་གཤེགས་པའི་ས་ལ་རབ་ཏུ་དགོད་པར་བྱ་བའི་ཕྱིར་ཆོས་སྟོན་ཏོ། །
en: I teach the Dharma so that beings who are in the countryside will surpass the paths of the śrāvakas and pratyeka­buddhas and be established on the level of the tathāgatas.

source: གྲོང་རྡལ་ན་འཁོད་པའི་སེམས་ཅན་རྣམས་ལ་ཆོས་ཀྱི་རྒྱལ་པོའི་ཕོ་བྲང་དུ་གནས་པར་འགྱུར་བར་བྱ་བའི་ཕྱིར་ཆོས་སྟོན་ཏོ། །
en: I teach the Dharma so that beings who live in towns will dwell in the palace of the king of the Dharma.

source: ཕྱོགས་མཚམས་ན་འཁོད་པའི་སེམས་ཅན་རྣམས་ལ་དུས་གསུམ་མཉམ་པ་ཉིད་ཀྱི་ཡེ་ཤེས་རབ་དུ་ཐོབ་པར་བྱ་བའི་ཕྱིར་ཆོས་སྟོན་ཏོ། །
en: I teach the Dharma so that beings who live in the intermediate directions will attain the knowledge of the equality of the three times.

source: ཕྱོགས་ན་གནས་པའི་སེམས་ཅན་རྣམས་ལ་ཆོས་ཐམས་ཅད་ཀྱི་ཡེ་ཤེས་མངོན་པར་ཤེས་པར་བྱ་བའི་ཕྱིར་ཆོས་སྟོན་ཏོ། །
en: I teach the Dharma so that beings who live in the principal directions will know the higher cognition of all phenomena.

source: འདོད་ཆགས་ལ་གཅིག་ཏུ་དགའ་བའི་སེམས་ཅན་རྣམས་ལ་མི་སྡུག་པའི་སྒོས་འཁོར་བའི་སྲེད་པ་རྣམ་པར་བཟློག་པའི་ཕྱིར་ཆོས་སྟོན་ཏོ། །
en: I teach the Dharma so that beings who delight only in desires will turn away from craving for saṃsāra because of passing through the gateway of its ugliness.

source: ཞེ་སྡང་ལ་སྤྱོད་པའི་སེམས་ཅན་རྣམས་ལ་བྱམས་པ་ཆེན་པོའི་ཚུལ་རྒྱ་མཚོ་ལ་འཇུག་པར་བྱ་བའི་ཕྱིར་ཆོས་སྟོན་ཏོ། །
en: I teach the Dharma so that beings who act out of anger will enter an ocean of the ways of great love.

source: གཏི་མུག་ལ་སྤྱོད་པའི་སེམས་ཅན་རྣམས་ལ་ཆོས་ཐམས་ཅད་ཀྱི་སྒོ་རྒྱ་མཚོ་རབ་ཏུ་འབྱེད་པའི་ཡེ་ཤེས་མངོན་པར་ཤེས་པར་བྱ་བའི་ཕྱིར་ཆོས་སྟོན་ཏོ། །
en: I teach the Dharma so that beings who act out of ignorance will have the higher cognition of the knowledge that analyzes an ocean of the gateways into all the Dharma.

source: ཆ་མཉམ་པ་ལ་སྤྱོད་པའི་སེམས་ཅན་རྣམས་ལ་ཐེག་པ་ཐམས་ཅད་ཀྱི་སྨོན་ལམ་གྱི་ཚུལ་རྒྱ་མཚོས་ཁྱད་པར་དུ་འགྲོ་བར་བྱ་བའི་ཕྱིར་ཆོས་སྟོན་ཏོ། །
en: I teach the Dharma so that beings whose conduct is equally that of desire, anger, and ignorance will have the preeminence of an ocean of the ways of aspiration for all the yānas.

source: འཁོར་བའི་ཡུལ་གྱི་དགའ་བའི་བསམ་པ་ཅན་གྱི་སེམས་ཅན་རྣམས་ལ་འཁོར་བའི་ཡུལ་ལ་དགའ་བ་རྣམ་པར་བཟློག་པའི་ཕྱིར་ཆོས་སྟོན་ཏོ། །
en: I teach the Dharma so that beings whose aspirations are to the sensory field of saṃsāra will turn away from the sensory field of saṃsāra.

source: འཁོར་བའི་སྡུག་བསྔལ་ཐམས་ཅད་ཀྱིས་གཙེས་པའི་སེམས་ཅན་རྣམས་ལ་འཁོར་བའི་སྡུག་བསྔལ་ཐམས་ཅད་ཀྱིས་ཉེ་བར་ཉོན་མོངས་བ་མེད་པར་བྱ་བའི་ཕྱིར་ཆོས་སྟོན་ཏོ། །
en: I teach the Dharma so that beings who are experiencing all the sufferings of saṃsāra will not be afflicted by any of the sufferings of saṃsāra.

source: དེ་བཞིན་གཤེགས་པས་འདུལ་བའི་སེམས་ཅན་རྣམས་ལ་མི་སྐྱེ་བའི་གནས་ཡང་དག་པར་བསྟན་པའི་ཕྱིར་ཆོས་སྟོན་ཏོ། །
en: I teach the Dharma so that beings who are guided by the tathāgatas will be taught the state of birthlessness.

source: ཕུང་པོ་ལ་གནས་པའི་བསམ་པ་ཅན་གྱི་སེམས་ཅན་རྣམས་ལ་གཞི་མེད་པའི་ཆོས་ཀྱི་སྤྱོད་ཡུལ་ལ་རྣམ་པར་སྤྱོད་པར་བྱ་བའི་ཕྱིར་ཆོས་སྟོན་ཏོ། །
en: I teach the Dharma so that beings who aspire to remain in the skandhas will dwell in the domain of the Dharma that has no location.

source: བསམ་པ་ཞུམ་པའི་སེམས་ཅན་རྣམས་ལ་ལམ་གྱི་རྒྱུན་གྱི་ཁྱད་པར་ཡང་དག་པར་བསྟན་པར་བྱ་བའི་ཕྱིར་ཆོས་སྟོན་ཏོ། །
en: I teach the Dharma so that beings who are discouraged will be taught the preeminent display of the path.

source: མཐོ་བའི་ང་རྒྱལ་ཅན་གྱི་སེམས་ཅན་རྣམས་ལ་ཆོས་ཐམས་ཅད་མཉམ་པ་ཉིད་ཀྱི་བཟོད་པ་ཡང་དག་པར་བསྟན་པར་བྱ་བའི་ཕྱིར་ཆོས་སྟོན་ཏོ། །
en: I teach the Dharma so that beings who have the pride of superiority will be taught the patience of the equality of all phenomena.

source: གཡོ་སྒྱུའི་ཡུལ་གྱི་བསམ་པ་དང་ལྡན་པའི་སེམས་ཅན་རྣམས་ལ་བྱང་ཆུབ་སེམས་དཔའི་བསམ་པ་ཡོངས་སུ་དག་པར་བྱ་བའི་ཕྱིར་ཆོས་སྟོན་ཏེ། དེ་ལྟར་རིགས་ཀྱི་བུ་ཁོ་མོ་ནི་སེམས་ཅན་ཐམས་ཅད་ཆོས་ཀྱི་སྦྱིན་པས་ཡོངས་སུ་བསྡུས་ཤིང་ངན་སོང་གི་ལམ་གྱི་རྒྱུད་སྡུག་བསྔལ་བ་ཐམས་ཅད་ནས་རྣམ་པར་བཟློག་པ་དང་། ལྷ་དང་མིའི་ཕུན་སུམ་ཚོགས་པ་དང་།
en: I teach the Dharma so that beings who are attracted to the field of deception and deceit will have the pure aspiration of the bodhisattvas.

source: བདེ་བ་ཡོངས་སུ་བསྟན་པ་དང་། ཁམས་གསུམ་པ་ལས་གྱེན་དུ་བསྐྱོད་པ་དང་། ཐམས་ཅད་མཁྱེན་པ་ཉིད་ལ་རབ་ཏུ་དགོད་པ་དང་། ཐབས་རྣམ་པ་སྣ་ཚོགས་ཀྱིས་ཡོངས་སུ་སྨྱིན་པར་བྱེད་བྱེད་པས། དགའ་བ་ཆེན་པོའི་ཤུགས་རྒྱ་མཚོའི་སྣང་བ་རབ་ཏུ་ཐོབ་པས་དགའ་ཞིང་སྤྲོ་ལ་ཡིད་བདེ་བར་གྱུར་པའོ། །གཞན་ཡང་རིགས་ཀྱི་བུ་ཁོ་མོ་ནི་ཕྱོགས་དང་།
en: “In that way, noble one, I gather all beings through the gift of the Dharma, turn them away from all the sufferings of the paths to the lower realms, teach them the good fortune and happiness of devas and humans, make them ascend from the three realms, establish them in omniscience, and ripen them through various methods so that they will attain the light of a powerful ocean of great happiness and thereby be joyful, delighted, and happy.

source: ཕྱོགས་མཚམས་ཀྱི་བྱང་ཆུབ་སེམས་དཔའི་འཁོར་གྱི་དཀྱིལ་འཁོར་རྒྱ་མཚོ་ལ་རྣམ་པར་ལྟ་ཞིང་སྨོན་ལམ་རྒྱ་མཚོ་ལ་སྤྱོད་པའི་བྱང་ཆུབ་སེམས་དཔའ་ལུས་སྣ་ཚོགས་རྣམ་པར་དག་པ། འོད་ཀྱི་དཀྱིལ་འཁོར་སྣ་ཚོགས་ཀྱི་རྒྱན་དང་ལྡན་པ། འོད་ཟེར་དང་འོད་ཀྱི་དཀྱིལ་འཁོར་ཁ་དོག་མཐའ་ཡས་པ་རབ་ཏུ་འགྱེད་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ཚུལ་རྒྱ་མཚོ་སྣ་ཚོགས་ལ་ཞུགས་པའི་ཡེ་ཤེས་སྣང་བ་ཅན། ཏིང་ངེ་འཛིན་རྒྱ་མཚོ་སྣ་ཚོགས་ལ་ཞུགས་པར་རྣམ་པར་འཕྲུལ་བ་སྣ་ཚོགས་ཀྱི་ཡུལ་དང་ལྡན་པ། དབྱངས་ཀྱི་ཡན་ལག་དང་སྐད་རྒྱ་མཚོ་སྣ་ཚོགས་ཀྱི་དབྱངས་དང་ལྡན་པ། རྒྱན་སྣ་ཚོགས་ཀྱིས་རྣམ་པར་ཀླུབས་པའི་ལུས་ཅན། དེ་བཞིན་གཤེགས་པའི་ཚུལ་སྣ་ཚོགས་ལ་ཞུགས་པ། ཞིང་རྒྱ་མཚོ་འབྱམ་ཀླས་པ་སྣ་ཚོགས་སུ་ཞུགས་པའི་ལུས་དང་ལྡན་པ། སངས་རྒྱས་རྒྱ་མཚོ་སྣ་ཚོགས་ལ་ཞུགས་པ། སོ་སོ་ཡང་དག་པར་རིག་པ་རྒྱ་མཚོ་སྣ་ཚོགས་ལ་ཞུགས་པ། དེ་བཞིན་གཤེགས་པའི་རྣམ་པར་ཐར་པ་དང་། ཡེ་ཤེས་ཀྱི་ཡུལ་སྣ་ཚོགས་ཀྱིས་སྣང་བར་གྱུར་པ། ཡེ་ཤེས་རྒྱ་མཚོ་སྣ་ཚོགས་ཀྱི་སྣང་བ་རབ་ཏུ་ཐོབ་པ། ཏིང་ངེ་འཛིན་རྒྱ་མཚོ་སྣ་ཚོགས་ཀྱི་ཚུལ་ལ་རྣམ་པར་སྤྱོད་པ་ཆོས་སྣ་ཚོགས་ཀྱི་རྣམ་པར་ཐར་པའི་གཞལ་མེད་ཁང་ན་རྣམ་པར་རྩེ་བའི་ཡུལ་དང་ལྡན་པ། ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་སྒོ་སྣ་ཚོགས་ལ་མངོན་དུ་གནས་པ། ཆོས་ཀྱི་དབྱིངས་སྣ་ཚོགས་ཀྱི་ནམ་མཁའི་རྒྱན་དང་ལྡན་པ། རྒྱན་སྣ་ཚོགས་ཀྱི་སྤྲིན་གྱིས་ནམ་མཁའ་རྒྱས་པར་འགེངས་པ། འཁོར་གྱི་དཀྱིལ་འཁོར་རྒྱ་མཚོ་སྣ་ཚོགས་ལ་རྣམ་པར་ལྟ་བ། འཇིག་རྟེན་གྱི་ཁམས་སྣ་ཚོགས་ནས་འདུས་པ། སངས་རྒྱས་ཀྱི་ཞིང་སྣ་ཚོགས་འབྱམ་ཀླས་པར་རྗེས་སུ་འདོང་བ། ཕྱོགས་རྒྱ་མཚོ་སྣ་ཚོགས་ནས་ཡོངས་སུ་འདུས་པ། དེ་བཞིན་གཤེགས་པ་ཐ་དད་པས་བཀྱེ་བ། དེ་བཞིན་གཤེགས་པ་ཐ་དད་པའི་ཞབས་ཀྱི་དྲུང་ནས་ལྷགས་པ། བྱང་ཆུབ་སེམས་དཔའི་ཚོགས་སྣ་ཚོགས་ཀྱི་འཁོར་དང་ལྡན་པ། རྒྱན་སྣ་ཚོགས་ཀྱི་སྤྲིན་གྱི་ཆར་རབ་ཏུ་འབེབས་པ། དེ་བཞིན་གཤེགས་པའི་ཚུལ་སྣ་ཚོགས་ལ་ཞུགས་པ་དེ་བཞིན་གཤེགས་པའི་ཆོས་རྒྱ་མཚོ་སྣ་ཚོགས་ལ་རྣམ་པར་སྤྱོད་པ།
en: “Moreover, noble one, I see the ocean of the assemblies of bodhisattvas in the principal and intermediate directions, bodhisattvas who have various pure bodies and engage in an ocean of prayers; who are adorned by various auras; who radiate light rays and auras of infinite colors; who have the light of wisdom that enters an ocean of the various ways of omniscience; who have entered into an ocean of various samādhis; who possess a range of various miraculous manifestations; who speak in an ocean of various voices and languages; who have bodies beautified by various adornments; who have entered the various ways of the tathāgatas; who have bodies that enter the vast extent of the ocean of various realms; who have entered an ocean of various buddhas; who have realized an ocean of various discernments; who have illuminated the range of the various liberations and wisdoms of the tathāgatas; who have attained the illumination of an ocean of the various wisdoms; who engage in the ways of an ocean of various samādhis; who possess the field of play in the divine palaces of the various liberations of the Dharma; who face the various gateways into omniscience; who have the various displays of the space of the realm of the Dharma; who pervade all space with clouds of various displays; who look upon the oceans of the various assemblies of followers; who gather together from different worlds; who go to the entire extent of the various buddha realms; who gather from the ocean of various directions; who come to be at the feet of various tathāgatas; who have retinues of various assemblies of bodhisattvas; who send down a rain from clouds of various displays; who have entered the various ways of the tathāgatas; who practice the ocean of the various Dharmas of the tathāgatas; who have entered an ocean of various wisdoms; and who are seated upon thrones that have a variety of adornments.

source: ཡེ་ཤེས་སྣ་ཚོགས་རྒྱ་མཚོ་ལ་ཞུགས་པ། རྒྱན་གྱི་སྙིང་པོ་སྣ་ཚོགས་ཅན་གྱི་སྟན་ལ་འཁོད་པ་རྣམས་ཀྱི་དགའ་བ་སྣ་ཚོགས་ཀྱི་ཤུགས་རྒྱ་མཚོ་ཡོངས་སུ་བསྐྱེད་དེ། དེ་དག་དགའ་བ་སྣ་ཚོགས་ཀྱི་ཤུགས་རྒྱ་མཚོ་ཡོངས་སུ་སྐྱེས་ནས།
en: Seeing them, I feel an ocean of various powerful joys.

source: དེ་བཞིན་གཤེགས་པའི་འཁོར་གྱི་དཀྱིལ་འཁོར་རྒྱ་མཚོར་འདོང་སྟེ། དེ་དག་དེ་བཞིན་གཤེགས་པའི་སྟོབས་ཚད་མེད་པ་རྗེས་སུ་སེམས་པས་ཀྱང་དགའ་བའི་ཤུགས་ཆེན་པོ་རྒྱ་མཚོ་ཡོངས་སུ་འབྱུང་བར་འགྱུར་རོ། །རིགས་ཀྱི་བུ་གཞན་ཡང་ཁོ་མོ་ནི་བཅོམ་ལྡན་འདས་རྣམ་པར་སྣང་མཛད་ཀྱི་གཟུགས་ཀྱི་སྐུ་ཡོངས་སུ་དག་པ་མཚན་གྱིས་རབ་ཏུ་བརྒྱན་པ། བསམ་གྱིས་མི་ཁྱབ་པ་མཐོང་ནས་དགའ་བ་ཆེན་པོ་དང་མོས་ཤིང་ཉམས་བདེ་བ་རབ་ཏུ་ཐོབ་སྟེ།
en: “Moreover, noble one, I see the inconceivable, completely pure form body of the Bhagavat Vairocana, which is adorned by the physical signs of a great being, and attain a great joy, delight, and happiness.

source: སེམས་ཀྱི་སྐད་ཅིག་རེ་རེ་ལའང་འོད་ཀྱི་དཀྱིལ་འཁོར་ཆོས་ཀྱི་དབྱིངས་ལྟར་ཡངས་པ། ཁ་དོག་རྒྱ་མཚོ་མཐའ་དང་དབུས་མེད་པར་སྣང་བ་ལ་ལྟ་ཞིང་སེམས་ཀྱི་སྐད་ཅིག་རེ་རེ་ལ་དགའ་བ་ཆེན་པོའི་ཤུགས་རྒྱ་མཚོ་རབ་ཏུ་ཐོབ་བོ། །
en: “I see, in each instant of mind, his aura of light, which is as vast as the realm of phenomena and is an ocean of colors without limit or center, and in each instant I attain an ocean of the power of great joy.

source: རིགས་ཀྱི་བུ་གཞན་ཡང་བཅོམ་ལྡན་འདས་རྣམ་པར་སྣང་མཛད་ཀྱི་སྐུའི་བ་སྤུའི་སྒོ་རེ་རེ་ནས་ཀྱང་འོད་གཟེར་ཆེན་པོ་སངས་རྒྱས་ཀྱི་ཞིང་མཐའ་དང་དབུས་མེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་བྱུང་སྟེ།
en: “Moreover, noble one, I see that from each pore on the body of the Bhagavat Vairocana shine great rays of light as numerous as the atoms in an extent of buddha realms that has no limit and no center.

source: འོད་ཟེར་རེ་རེ་ཞིང་ཡང་འོད་ཟེར་རྒྱ་མཚོ་སངས་རྒྱས་ཀྱི་ཞིང་མཐའ་ཡས་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཀྱི་འཁོར་དང་ལྡན་པས་ཆོས་ཀྱི་དབྱིངས་ཐམས་ཅད་རྒྱས་པར་འགེངས་པ་དང་།
en: Each of those light rays is accompanied by an ocean of light rays that are as numerous as the atoms in endless buddha realms, and they fill the entire realm of phenomena and cause the sufferings of all beings to cease.
